In [6]:
import pandas as pd
import numpy as np

In [7]:
df=pd.read_csv("income.csv")

In [8]:
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [14]:
df=pd.read_csv("income.csv",names=["Name","Income"])

In [16]:
df=pd.read_csv("income.csv",names=["Name","Income"],skiprows=[0])

In [17]:
df

        Name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [18]:
df["Income"][3]=np.nan

C:\Users\suraj\AppData\Local\Temp\ipykernel_10072\431223105.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Income"][3]=np.nan

df.income.mean()

In [19]:
df.Income.mean()

1671666.6666666667

In [20]:
df_new=df.fillna(df.Income.mean())
df_new

        Name        Income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [21]:
df.Income.median()

6500.0

In [22]:
df_new=df.fillna(df.Income.median())
df_new

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0